{
  "recipes": [
    {
      "prepTime": "7 Hrs",
      "ingredients": "2 cups green moong beans\\n1 green chilly - chopped\\n½ inch ginger - chopped\\n¼cup chopped coriander leaves - optional\\nsalt as required",
      "stepsGuide": "Firstly, pick and rinse the moong beans.\\nThen soak the moong beans overnight in enough water.\\nDrain and add the moong beans along with ginger, green chilies, coriander leaves and salt in a grinder jar.\\nAdd some water and grind into a smooth batter.\\nRemove the batter in a bowl or pan.\\n\\nOn a griddle or flat pan, spread a little oil or ghee.\\nWith a ladle, pour the dosa batter on the griddle and use the same spoon for spreading the moong dal dosa batter into a round shape.\\nPour some oil on the sides and in the center of the dosa.\\nFlip and cook both sides a couple of times till crisp and browned.\\nServe the moong dal dosa with upma and coconut chutney.",
      "id": 1,
      "title": "Moong Dal Dosa",
      "cookingTime": "20 Mins",
      "cover": "https://github.com/chintanrparmar/COOK.it/raw/master/images/moong_dosa.jpg",
      "category": "breakfast"
    },
    {
      "id": 2,
      "title": "Aloo Paratha",
      "cookingTime": "30 Mins",
      "cover": "https://github.com/chintanrparmar/COOK.it/raw/master/images/AlooParatha.jpg",
      "prepTime": "20 Mins",
      "ingredients": "for aloo paratha stuffing\\n3 to 4 medium potatoes\\n1 to 2 green chilies, chopped finely\\n¼ to ½ teaspoon kashmiri red chilli powder\\n¼ to ½ teaspoon garam masala powder\\n½ to 1 teaspoon amchur\\n2 to 3 teaspoons finely chopped coriander leaves, optional\\nsalt as required\\noil or ghee, as required for roasting parathas\\n\\nfor paratha dough\\n2 cups whole wheat flour\\n½ teaspoon salt or add as required\\n1 tablespoon oil or ghee\\nwater as required for kneading",
      "stepsGuide": "making stuffing\\nFirst boil the potatoes and peel them.\\nChop and mash the potatoes.\\nThe potatoes should be mashed very well.\\nNow add the chopped green chilies, garam masala powder, red chili powder, dry mango powder and salt.\\nMix the spice powders and green chilies with the mashed potatoes very well.\\n\\nkneading dough\\nIn another bowl, take whole wheat flour (atta).\\nMake a well in the center. Add salt, oil and about half of the water.\\nBring the mixture together and knead into a smooth soft dough.\\nCover and keep the dough aside for 20 to 30 minutes.\\n\\nrolling and stuffing aloo paratha\\nPinch two small balls from the dough. Flatten them and dust with whole wheat flour.\\nWith a rolling pin, roll them into about 4 to 5 inches diameter rounds . Try making both the rounds of the same size.\\nOn one of the rolled dough circle, place the potato stuffing in the center and keep about 1 inch empty space from the sides.\\nGently place the second circle on top.\\nPress and seal the edges with your fingertips.\\nDust some flour on the stuffed paratha and roll into a round of about 7 to 8 inches in diameter or about the size of a normal roti or chapati.\\n\\nmaking aloo ke parathe\\nOn a hot tava (tawa or skillet or griddle) place the rolled paratha.\\nThe Tava shoud be hot and not at a low temp. Cooking parathas at a low flame will harden them. Parathas ideally are crisp as well as soft.\\nWhen the base is partly cooked, flip the paratha.\\nSpread some ghee on the partly cooked part.\\nFlip again and this time this side has to be cooked more than the previous side. You will see brown spots on the paratha.\\nServe hot.",
      "category": "breakfast"
    },
    {
      "prepTime": "20 Mins",
      "stepsGuide": "making khandvi batter\\nTake the yogurt in a bowl. Add water and stir well till smooth.\\nAdd ginger-green chili paste, turmeric powder,  and salt.\\nIf using fresh yogurt, then to add the sourness, add about ½ tsp of lemon juice.\\nAdd the gram flour/besan. With a wired whisk, keep on stirring and mixing till all the lumps are dissolved and you get a smooth batter. There should be no lumps in the batter.\\nSpread oil on plates or boards or tray. Large steel lids or thalis work very well.\\nAlso mix the chopped coriander leaves and grated coconut. Keep aside.\\nPour the batter in a sauce pan or a broad frying pan. Switch on the stove top and keep the flame to the lowest. Begin to stir.\\nKeep on stirring when the khandvi batter is getting heated up. Lumps begin to form and you have to continuously stir so that the lumps don't form.\\nThe batter would thicken and keep on thickening. Keep on stirring.\\nThe batter also should not be allowed to stick at the bottom. So you have to stir continuously.\\nDo a plate test when the batter has thickened well.\\nSpread a few teaspoons of the batter on a greased plate. Let it cool a bit and then begin to roll. If you are unable to roll, then the batter needs to be cooked more.\\nIt took me 17 minutes to get the correct consistency on a low flame. The timing will vary depending on the intensity of the flame, the thickness/thinness of the pan and the size of the pan. Just do the plate test and when you can form the rolls, then the khandvi batter is ready. If the batter becomes too thick, then it becomes difficult to spread and you don't get thin layers in the rolls. In this case, still spread the batter. You will get thick slices, but still they taste good.\\n\\nmaking khandvi rolls\\nQuickly pour about ½ to ⅔ cup of batter on a large plate and spread thinly & evenly with a spatula. You have to be quick with the remaining batter too. Since even a bit of cooling and the batter becomes likes blob, difficult to spread.\\nAllow to cool and then sprinkle the coconut + coriander leaves mixture sparingly. You can also skip this stuffing part and directly garnish with the coconut and coriander once you temper the khandvi rolls.\\nCut into equal sized strips.\\nGently roll each strip tightly. Then place them in a serving tray or plate.if the tray or plate is large, then you will get large rolls. In this case after you finish rolling half, just cut horizontally and make a second roll.\\nArrange the khandvi rolls next to each other or stack them up neatly in a plate or tray.\\n\\ntempering (seasoning) for khandvi\\nHeat oil and crackle the mustard seeds.\\nThen add curry leaves, green chilies and fry for a few seconds.\\nAdd the sesame seeds and when they change color & crackle, pour the hot tempering mixture along with the oil on the khandvi rolls evenly.\\nYou can garnish it with some more coconut and coriander leaves, if you prefer. Serve khandvi with coriander chutney or coriander mint chutney.",
      "ingredients": "for khandvi batter\\n1 cup besan\\n¾ cup sour curd\\n2.25 cups water, to be mixed with the curd\\n1 teaspoon ginger + green chili paste, about ½ inch ginger & 1 green chili crushed in a mortar-pestle\\n¼ teaspoon turmeric powder\\n⅔ teaspoon salt\\n\\nfor the filling\\n2 tablespoons fresh grated coconut\\n2 tablespoons chopped coriander leaves\\n\\nfor the khandvi seasoning\\n1 tablespoon oil\\n8 to 10 curry leaves\\n1 teaspoon mustard seeds\\n2 teaspoons white sesame seeds\\n1 teaspoon green chili , chopped or ½ red chilli powder\n",
      "id": 3,
      "title": "Khandvi Roll",
      "category": "lunch",
      "cookingTime": "20 Mins",
      "cover": "https://github.com/chintanrparmar/COOK.it/raw/master/images/Khandvi.jpg"
    },
    {
      "prepTime": "25 Mins",
      "stepsGuide": "preparation\\nRinse, peel and chop all the veggies.\\nFirst steam or pressure cook all the veggies, except capsicum till they are completely cooked.\\nIn a kadai or pan, dry roast coriander and dry red chilies till they become aromatic and crisp.\\nRemove them in a plate and allow to cool.\\nWhen cooled, grind both coriander seeds and dry red chilies in a dry grinder to a fine or semi fine powder.\\nChop the tomatoes, ginger and green chili. Blend all three of them to make a smooth puree.\\n\\nmaking no onion no garlic pav bhaji\\nHeat oil or butter in a kadai or pan. Splutter the cumin first.\\nIf adding capsicum/green bell pepper, add these now and saute till they are almost cooked.\\nAdd the tomato-ginger-green-chili puree and stir. Saute the puree for a minute.\\nAdd the freshly ground coriander-red chili powder and stir.\\nAfter 4 minutes, add the red chili powder, pav bhaji masala and garam masala powder.\\nLastly add the turmeric powder.\\nWhen you see the oil leaving the sides of the masala, then add the cooked veggies.\\nStir well. pour water.\\nWith a potato masher, mash the veggies directly into the kadai. Be careful when doing so, so that mixture does not come out.\\nDon't mash completely and make a puree. Some bite and texture should be there.\\nAdd salt simmer on a low flame for 10-12 minutes. stir occasionally.\\nIf you feel the bhaji to be of thick consistency, then add little water.\\nWhen the bhaji is simmering, you can slice the bread or rolls/pav and pan fry them with some oil or butter.\\nServe the bhaji hot with some lemon wedges, coriander leaves and topped with some butter or oil along with the lightly pan fried bread.",
      "ingredients": "for the bhaji\\n1 small gobi\\n2 large potatoes\\n1.5 cup peas\\n1 cup chopped carrot\\n1 shimla mirch \\n1.5 to 2 tablespoon pav bhaji masala\\n¼ or ½ teaspoon garam masala powder\\n½ or 1 teaspoon dry mango powder\\n2 cups water\\n4 to 5 tablespoon oil or butter\\nsalt\\n\\nfor dry roasting\\n3 to 4 dry red chilies\\n1.5 or 2 tablespoon coriander seeds\\n\\nfor the tomato puree\\n2 inch ginger - peeled and chopped\\n1 green chili - chopped\\n2.5 to 3 cups chopped tomatoes\\n\\nfor garnish and serving\\n1 large lemon - quartered\\n¼ cup chopped coriander leaves\\n15 pavs",
      "id": 4,
      "title": "Pav Bhaji",
      "category": "dinner",
      "cookingTime": "20 Mins",
      "cover": "https://github.com/chintanrparmar/COOK.it/raw/master/images/Pavbhaji.jpg"
    }
  ]
}